{
  "chapters": [
    {
      "chapterNumber": 1,
      "title": "The Sand of Intelligence",
      "description": "Discover how ordinary sand contains the secret ingredient for computer chips",
      "narration": [
        {
          "text": "Hi there! I'm Silico, your silicon guide! Look down at the ground. What do you see? Just sand? Think again. Hidden inside those tiny grains is something magical — a shiny crystal.",
          "voice": "audio/scene1_1.mp3",
          "visual": "desert_scene",
          "duration": 5000
        },
        {
          "text": "This shiny crystal you see is quartz - And deep inside quartz… lies silicon — the secret ingredient of every computer chip on Earth!",
          "voice": "audio/scene1_2.mp3",
          "visual": "quartz_crystal",
          "duration": 6000
        },
        {
          "text": "But not all rocks are the same. Some sparkle with potential, others don’t. Can you spot the pure quartz? Let's try your first challenge?",
          "voice": "audio/scene1_3.mp3",
          "visual": "rock_collection",
          "duration": 5000
        }
      ],
      "game": {
        "name": "Quartz Sorter",
        "description": "Sort pure quartz crystals from other rocks using drag & drop",
        "type": "sorting",
        "script": "games/quartz-sorter.js"
      }
    },
    {
      "chapterNumber": 2,
      "title": "The Great Purification",
      "description": "Learn how raw silicon is purified in massive furnaces",
      "narration": [
        {
          "text": "Great job finding those quartz crystals! But this silicon is still mixed with a lot of junk — like dirt and other elements. Time to clean it up..... This happens in giant furnaces!",
          "voice": "audio/scene2_1.mp3",
          "visual": "furnace_exterior",
          "duration": 5000
        },
        {
          "text": "We use giant furnaces hotter than volcanoes! The furnace heats up to over 2000°C! Imagine fire so intense, it glows bright orange. Inside, we mix quartz with carbon and blast away the bad stuff.",
          "voice": "audio/scene2_2.mp3",
          "visual": "furnace_interior",
          "duration": 6000
        },
        {
          "text": "Careful though! If it gets too hot or cool, we mess up the process. Think you can handle the heat and make the world’s purest silicon? Let’s try!",
          "voice": "audio/scene2_3.mp3",
          "visual": "control_panel",
          "duration": 5000
        }
      ],
      "game": {
        "name": "Furnace Controller",
        "description": "Control furnace temperature and valves to purify silicon",
        "type": "control",
        "script": "games/furnace-controller.js"
      }
    },
    {
      "chapterNumber": 3,
      "title": "Growing the Perfect Crystal",
      "description": "Watch as molten silicon grows into perfect crystal structures",
      "narration": [
        {
          "text": "Excellent temperature control! Now we have molten silicon. but we need to turn it into a crystal. Not just any crystal — one that's strong, smooth, and smart for computer chips.",
          "voice": "audio/scene3_1.mp3",
          "visual": "molten_silicon",
          "duration": 5000
        },
        {
          "text": "We dip a tiny crystal seed into melted silicon and pull it out slowly while spinning it. It’s like making a magical silicon lollipop!",
          "voice": "audio/scene3_2.mp3",
          "visual": "crystal_growing",
          "duration": 7000
        },
        {
          "text": "Pull too fast — it breaks. Spin too slow — it twists. Get the speed just right, and we grow a perfect crystal rod. Ready to give it a spin?",
          "voice": "audio/scene3_3.mp3",
          "visual": "crystal_rotation",
          "duration": 6000
        }
      ],
      "game": {
        "name": "Crystal Grower",
        "description": "Control rotation speed and pulling rate to grow perfect silicon crystals",
        "type": "precision",
        "script": "games/crystal-grower.js"
      }
    },
    {
      "chapterNumber": 4,
      "title": "Slicing the Silicon Wafer",
      "description": "Cut the crystal into thin wafers - the foundation of all chips",
      "narration": [
        {
          "text": "Perfect! You've grown a beautiful silicon crystal, called an ingot. Now we need to slice your crystal into super thin wafers — like slicing cheese, but much harder!",
          "voice": "audio/scene4_1.mp3",
          "visual": "silicon_ingot",
          "duration": 5000
        },
        {
          "text": "Now we need to slice your crystal into super thin wafers — like slicing cheese, but much harder!",
          "voice": "audio/scene4_2.mp3",
          "visual": "wafer_slicing",
          "duration": 6000
        },
        {
          "text": "After slicing, we polish them until they shine like mirrors — because even a tiny scratch can ruin everything. Let's slice and shine like pros!",
          "voice": "audio/scene4_3.mp3",
          "visual": "wafer_polishing",
          "duration": 6000
        }
      ],
      "game": {
        "name": "Wafer Slicer",
        "description": "Slice silicon ingots and polish wafers to perfection",
        "type": "slicing",
        "script": "games/wafer-slicer.js"
      }
    },
    {
      "chapterNumber": 5,
      "title": "Building Logic Gates",
      "description": "Create the basic building blocks of computer logic",
      "narration": [
        {
          "text": "Now we have perfect silicon wafers! Time to build logic gates - the basic elements that make computers think.",
          "voice": "audio/scene5_1.mp3",
          "visual": "clean_wafer",
          "duration": 5000
        },
        {
          "text": "Logic gates are like tiny decision-makers - like tiny switches that say ‘Yes’ or ‘No’, ‘On’ or ‘Off’. That’s how computers think! We create them by adding special materials to specific areas of the wafer.",
          "voice": "audio/scene5_2.mp3",
          "visual": "logic_gates",
          "duration": 7000
        },
        {
          "text": "We use light and patterns — to draw these tiny circuits. Using photolithography, we shine light through masks to create patterns. It's like using stencils, but incredibly precise!",
          "voice": "audio/scene5_3.mp3",
          "visual": "photolithography",
          "duration": 6000
        }
      ],
      "game": {
        "name": "Gate Designer",
        "description": "Arrange gate masks to complete logic gate designs",
        "type": "puzzle",
        "script": "games/gate-designer.js"
      }
    },
    {
      "chapterNumber": 6,
      "title": "Connecting the Brain",
      "description": "Wire up logic gates to create computational circuits",
      "narration": [
        {
          "text": "Great work creating those logic gates! Now that we have the thinking parts, let’s connect them into a real brain! We’ll link ANDs, ORs, and NOTs to make circuits that do math and more!",
          "voice": "audio/scene6_1.mp3",
          "visual": "individual_gates",
          "duration": 5000
        },
        {
          "text": "This combo of gates creates something powerful — the ALU, or Arithmetic Logic Unit — the part that lets computers calculate inside every processor!",
          "voice": "audio/scene6_2.mp3",
          "visual": "alu_circuit",
          "duration": 7000
        },
        {
          "text": "Let's build a simple ALU that can add numbers. Connect the gates correctly and watch the magic happen!",
          "voice": "audio/scene6_3.mp3",
          "visual": "alu_construction",
          "duration": 6000
        }
      ],
      "game": {
        "name": "Circuit Builder",
        "description": "Connect logic gates to build working computational circuits",
        "type": "connection",
        "script": "games/circuit-builder.js"
      }
    },
    {
      "chapterNumber": 7,
      "title": "Programming the Silicon Brain",
      "description": "Write your first program for the silicon chip you helped create",
      "narration": [
        {
          "text": "Amazing! You've built a working processor - now it’s time to teach it! That’s called programming. This is where silicon truly becomes a 'brain'.",
          "voice": "audio/scene7_1.mp3",
          "visual": "working_processor",
          "duration": 6000
        },
        {
          "text": "A program is like a recipe. You give step-by-step instructions, and the silicon brain follows them exactly. It's just sequences of instructions that tell the processor what to do. Let's start with simple commands like 'add' and 'store'.",
          "voice": "audio/scene7_2.mp3",
          "visual": "instruction_set",
          "duration": 6000
        },
        {
          "text": "You'll drag and drop code blocks to create a program. Watch how your silicon creation follows your instructions perfectly!",
          "voice": "audio/scene7_3.mp3",
          "visual": "visual_programming",
          "duration": 6000
        }
      ],
      "game": {
        "name": "Code Builder",
        "description": "Create programs using drag-and-drop code blocks",
        "type": "programming",
        "script": "games/code-builder.js"
      }
    },
    {
      "chapterNumber": 8,
      "title": "The Silicon Revolution",
      "description": "Celebrate your journey and see how silicon powers our modern world",
      "narration": [
        {
          "text": "Congratulations! You did it, genius! From beach sand to a silicon brain — you’ve built the heart of modern technology.",
          "voice": "audio/scene8_1.mp3",
          "visual": "journey_recap",
          "duration": 6000
        },
        {
          "text": "The silicon chip you helped create is now the brain of smartphones, computers, cars, and even space rockets!",
          "voice": "audio/scene8_2.mp3",
          "visual": "silicon_applications",
          "duration": 7000
        },
        {
          "text": "From a grain of sand to the most important technology of our time - you've witnessed the silicon revolution! Ready for your certificate?",
          "voice": "audio/scene8_3.mp3",
          "visual": "celebration",
          "duration": 6000
        }
      ],
      "game": {
        "name": "Chip Matching Challenge",
        "description": "Match silicon chips to the devices they power in our modern world",
        "type": "matching",
        "script": "games/chip-matching.js"
      }
    }
  ]
}